#группа: Pyth-p-Ap-62402/7МОп
#Степанов Владимир Викторович

#Урок №3. Ввод-вывод и базовые переменные
#Задание 1.

type_of_pet = input('Введите тип питомца:')
nickname = input('Введите кличку питомца:')
age_of_pet = input('Введите возраст питомца:')

print(f'Это {type_of_pet} по кличке "{nickname}". Возраст {age_of_pet} года.')
#end

#Задание 2.

type_homo_1 = input('Введите первый этап развития человека:')
type_homo_2 = input('Введите второй этап развития человека:')
type_homo_3 = input('Введите третий этап развития человека:')
type_homo_4 = input('Введите четвертый этап развития человека:')
type_homo_5 = input('Введите пятый этап развития человека:')
type_homo_6 = input('Введите шестой этап развития человека:')

print( type_homo_1, type_homo_2, type_homo_3, type_homo_4, type_homo_5, type_homo_6, sep=' => ' )
#end
