#группа: Pyth-p-Ap-62402/7МОп
#Степанов Владимир Викторович

#Урок №3. Ввод-вывод и базовые переменные
#Задание 1.

type_of_pet = input('Введите тип питомца:')
nickname = input('Введите кличку питомца:')
age_of_pet = input('Введите возраст питомца:')

print(f'Это {type_of_pet} по кличке "{nickname}". Возраст {age_of_pet} года.')
#end

#Задание 2.

